
    csv = '\
"Region","Color code","Comment"\n\
"Алтайский край","#49C0B5",\n\
"Амурская область","#49C0B5",\n\
"Архангельская область","#49C0B5",\n\
"Астраханская область","#3D4C76",\n\
"Белгородская область","#3D4C76",\n\
"Брянская область","#3D4C76",\n\
"Владимирская область","#49C0B5",\n\
"Волгоградская область","#49C0B5",\n\
"Вологодская область","#3D4C76",\n\
"Воронежская область","#3D4C76",\n\
"Еврейская автономная область","#3D4C76",\n\
"Забайкальский край","#3D4C76",\n\
"Ивановская область","#3D4C76",\n\
"Иркутская область","#49C0B5",\n\
"Кабардино-Балкарская Республика","#49C0B5",\n\
"Калининградская область","#49C0B5",\n\
"Калужская область","#49C0B5",\n\
"Камчатский край","#3D4C76",\n\
"Карачаево-Черкесская Республика","#3D4C76",\n\
"Кемеровская область","#49C0B5",\n\
"Кировская область","#3D4C76",\n\
"Костромская область","#3D4C76",\n\
"Краснодарский край","#49C0B5",\n\
"Красноярский край","#F0E68C","Отменен режим карантина для прибывающих из Москвы и Петербурга."\n\
"Курганская область","#3D4C76",\n\
"Курская область","#49C0B5",\n\
"Ленинградская область","#49C0B5",\n\
"Липецкая область","#3D4C76",\n\
"Магаданская область","#3D4C76",\n\
"Московская область","#49C0B5",\n\
"Мурманская область","#49C0B5",\n\
"Нижегородская область","#49C0B5",\n\
"Новгородская область","#3D4C76",\n\
"Новосибирская область","#49C0B5",\n\
"Омская область","#49C0B5",\n\
"Оренбургская область","#3D4C76",\n\
"Орловская область","#49C0B5",\n\
"Пензенская область","#3D4C76",\n\
"Пермский край","#49C0B5",\n\
"Приморский край","#49C0B5",\n\
"Псковская область","#3D4C76",\n\
"Республика Адыгея","#F0E68C","На территорию республики можно въехать только с разрешением и на личном автотранспорте."\n\
"Республика Алтай","#3D4C76",\n\
"Республика Башкортостан","#49C0B5",\n\
"Республика Бурятия","#49C0B5",\n\
"Республика Дагестан","#3D4C76",\n\
"Республика Ингушетия","#49C0B5",\n\
"Республика Калмыкия","#3D4C76",\n\
"Республика Карелия","#F0E68C","Карантина нет только для тех, кто едет в Рускеалу или на Валаамский архипелаг (его уже открыли для туристов)."\n\
"Республика Коми","#3D4C76",\n\
"Республика Марий Эл","#3D4C76",\n\
"Республика Мордовия","#3D4C76",\n\
"Республика Саха (Якутия)","#3D4C76",\n\
"Республика Северная Осетия — Алания","#3D4C76",\n\
"Республика Татарстан","#49C0B5",\n\
"Республика Тыва","#3D4C76",\n\
"Республика Хакасия","#49C0B5",\n\
"Ростовская область","#3D4C76",\n\
"Рязанская область","#3D4C76",\n\
"Самарская область","#3D4C76",\n\
"Саратовская область","#3D4C76",\n\
"Сахалинская область","#3D4C76",\n\
"Свердловская область","#49C0B5",\n\
"Смоленская область","#49C0B5",\n\
"Ставропольский край","#3D4C76",\n\
"Тамбовская область","#49C0B5",\n\
"Тверская область","#49C0B5",\n\
"Томская область","#F0E68C","Режим самоизоляции сохраняется только для прибывающих из Республики Саха (Якутия)."\n\
"Тульская область","#49C0B5",\n\
"Тюменская область","#49C0B5",\n\
"Удмуртская Республика","#49C0B5",\n\
"Ульяновская область","#49C0B5",\n\
"Хабаровский край","#3D4C76",\n\
"Челябинская область","#49C0B5",\n\
"Чеченская Республика","#3D4C76",\n\
"Чувашская Республика","#3D4C76",\n\
"Чукотский автономный округ","#3D4C76",\n\
"Ярославская область","#49C0B5",\n\
"Санкт-Петербург","#49C0B5",\n\
"Москва","#49C0B5",\n\
"Ненецкий автономный округ","#3D4C76",\n\
"Ханты-Мансийский автономный округ","#F0E68C","Режим самоизоляции сохраняется только для прибывающих из республик Башкортостан, Дагестан, Саха (Якутия)."\n\
"Ямало-Ненецкий автономный округ","#F0E68C","Нужно иметь справку об отсутствии COVID-19."\n\
"Севастополь","#3D4C76",\n\
"Республика Крым","#F0E68C","крымские санатории и гостиницы встречают пока только крымчан. Туристов из других регионов страны будут принимать с 1 июля. Как вариант — можете снимать жилье у местных жителей, если собираетесь отдохнуть в июне."\n\
'


var data = Papa.parse(csv);

// console.log(data)
var dataDict = {};
data.data.forEach(function (item, index) {
    if (index > 0) {
        dataDict[item[0]] = [item[1], item[2]]
    }
});


ymaps.ready(init);

function init() {
  
    var map = new ymaps.Map('map', {
        center: [58.704272, 95.602030],
        zoom: 2,
        type: 'yandex#map',
        controls: ['zoomControl']
    });
    map.controls.get('zoomControl').options.set({size: 'small'});
    // Зададим цвета для раскрашивания.
    // Обратите внимание, для раскраски более крупных карт нужно задавать пятый цвет.
    var colors = ['#F0F075', '#F0E68C', '#3D4C76', '#49C0B5'];


    var objectManager = new ymaps.ObjectManager();
    
    var colorCounter = 0;
    
    // Загрузим регионы.
    ymaps.borders.load('RU', {
        lang: 'ru',
        quality: 2
    }).then(function (result) {
        // Очередь раскраски.
        var queue = [];
        // Создадим объект regions, где ключи это ISO код региона.
        var regions = result.features.reduce(function (acc, feature) {
            // Добавим ISO код региона в качестве feature.id для objectManager.
            var iso = feature.properties.iso3166;
            feature.id = iso;
            
            // Добавим опции региона по умолчанию.
            feature.options = {
                fillOpacity: 0.6,
                strokeColor: '#FFF',
                fillColor: dataDict[feature.properties.name][0],
                strokeOpacity: 0.5
            };

            if (dataDict[feature.properties.name][1]) {
                feature.properties.hintContent = feature.properties.hintContent + ": " + dataDict[feature.properties.name][1];
            }

            acc[iso] = feature;
            return acc;
        }, {});

        // Добавим регионы на карту.
        result.features = [];
        for (var reg in regions) {
            result.features.push(regions[reg]);
        }
        objectManager.add(result);
        map.geoObjects.add(objectManager);
    })
}
